package by.epam.les03.main;

public class Task02 {
	//Составить программу сравнения двух чисел 1 и 2. Если 1 меньше 2 – вывести на экран слово «yes», в противном случае – слово «no»
	public static void main(String[] args) {
		int a, b;
		a = -20;
		b = -10;
		if (a<b)
			System.out.println("yes");
		else 
			System.out.println("no");
		
	}
	

}
