package by.epam.les03.main;

public class Task01 {
	//Составить программу сравнения двух чисел 1 и 2. Если 1 меньше 2 – вывести на экран цифру 7, в противном случае – цифру 8.
	public static void main(String[] args) {
		int a, b;
		a = 3;
		b = -275;
		if (a<b)
			System.out.println("7");
		else 
			System.out.println("8");
		
	}

}
