package by.epam.les03.main;

public class Task24 {
	//Составить программу, определяющую результат гадания на ромашке — «любит—не любит», взяв за исходное данное количество лепестков п.
	

	public static void main(String[] args) {
		int n = 13;
		if (n%2==0)
			System.out.println("не любит");
		else 
			System.out.println("любит");
		
	}
}	