package by.epam.les03.main;

public class Task03 {
	//Составить программу сравнения введенного числа а и цифры 3. Вывести на экран слово «yes», если число а меньше 3; если больше, то вывести слово «no»

	public static void main(String[] args) {
		int a;
		a = 4;
		if (a<3)
			System.out.println("yes");
		else 
			System.out.println("no");
	}	
}
